# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  [[-1, 1, Conv_maxpool, [24]],  # 0-P2/4

   [-1, 1, ShuffleNetV2_InvertedResidual, [116, 2]], # 1-P3/8
   [-1, 3, ShuffleNetV2_InvertedResidual, [116, 1]], # 2

   [-1, 1, ShuffleNetV2_InvertedResidual, [232, 2]], # 3-P4/16
   [-1, 7, ShuffleNetV2_InvertedResidual, [232, 1]], # 4

   [-1, 1, ShuffleNetV2_InvertedResidual, [464, 2]], # 5-P5/32
   [-1, 3, ShuffleNetV2_InvertedResidual, [464, 1]], # 6

   [-1, 1, DWConv2D, [1024, 1, 1]],  # Ensure 1024 channels before SPPF
   [-1, 1, SPPF, [1024, 5]],  # 8
  ]
  
head:
  [[-1, 1, DWConv2D, [512, 1, 1]],  # Replaced Conv with DWConv2D
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  

   [-1, 1, DWConv2D, [256, 1, 1]],  
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  

   [-1, 1, DWConv2D, [256, 3, 2]],  
   [[-1, 12], 1, Concat, [1]], # cat head P4
   [-1, 3, C3, [512, False]],  

   [-1, 1, DWConv2D, [512, 3, 2]],  
   [[-1, 9], 1, Concat, [1]], # cat head P5
   [-1, 3, C3, [1024, False]],  

   [[16, 19, 22], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
